; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	infrared0 - mode
	infrared2 - mode
	spectrograph3 - mode
	thermograph1 - mode
	GroundStation0 - direction
	Star2 - direction
	Star1 - direction
	Phenomenon3 - direction
	Star4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 120)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph3)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 infrared2)
	(supports instrument3 infrared0)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 108)
	(supports instrument4 infrared2)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 Star2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon3)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 153)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star1)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 163)
	(= (data Phenomenon3 infrared0) 106)
	(= (data Star4 infrared0) 15)
	(= (data Planet5 infrared0) 299)
	(= (data Phenomenon6 infrared0) 272)
	(= (data Planet7 infrared0) 77)
	(= (data Planet8 infrared0) 272)
	(= (data Phenomenon3 infrared2) 284)
	(= (data Star4 infrared2) 155)
	(= (data Planet5 infrared2) 94)
	(= (data Phenomenon6 infrared2) 40)
	(= (data Planet7 infrared2) 296)
	(= (data Planet8 infrared2) 18)
	(= (data Phenomenon3 spectrograph3) 292)
	(= (data Star4 spectrograph3) 273)
	(= (data Planet5 spectrograph3) 136)
	(= (data Phenomenon6 spectrograph3) 51)
	(= (data Planet7 spectrograph3) 98)
	(= (data Planet8 spectrograph3) 240)
	(= (data Phenomenon3 thermograph1) 138)
	(= (data Star4 thermograph1) 169)
	(= (data Planet5 thermograph1) 184)
	(= (data Phenomenon6 thermograph1) 49)
	(= (data Planet7 thermograph1) 152)
	(= (data Planet8 thermograph1) 279)
	(= (slew_time Star2 GroundStation0) 30)
	(= (slew_time GroundStation0 Star2) 30)
	(= (slew_time Star2 Star1) 65.7)
	(= (slew_time Star1 Star2) 65.7)
	(= (slew_time Star1 GroundStation0) 36.44)
	(= (slew_time GroundStation0 Star1) 36.44)
	(= (slew_time Phenomenon3 GroundStation0) 44.59)
	(= (slew_time GroundStation0 Phenomenon3) 44.59)
	(= (slew_time Phenomenon3 Star1) 32.42)
	(= (slew_time Star1 Phenomenon3) 32.42)
	(= (slew_time Phenomenon3 Star2) 20.46)
	(= (slew_time Star2 Phenomenon3) 20.46)
	(= (slew_time Star4 GroundStation0) 52.22)
	(= (slew_time GroundStation0 Star4) 52.22)
	(= (slew_time Star4 Star1) 25.52)
	(= (slew_time Star1 Star4) 25.52)
	(= (slew_time Star4 Star2) 38.61)
	(= (slew_time Star2 Star4) 38.61)
	(= (slew_time Star4 Phenomenon3) 55.16)
	(= (slew_time Phenomenon3 Star4) 55.16)
	(= (slew_time Planet5 GroundStation0) 43.93)
	(= (slew_time GroundStation0 Planet5) 43.93)
	(= (slew_time Planet5 Star1) 0.9441)
	(= (slew_time Star1 Planet5) 0.9441)
	(= (slew_time Planet5 Star2) 42.92)
	(= (slew_time Star2 Planet5) 42.92)
	(= (slew_time Planet5 Phenomenon3) 12.77)
	(= (slew_time Phenomenon3 Planet5) 12.77)
	(= (slew_time Planet5 Star4) 64.78)
	(= (slew_time Star4 Planet5) 64.78)
	(= (slew_time Phenomenon6 GroundStation0) 27.23)
	(= (slew_time GroundStation0 Phenomenon6) 27.23)
	(= (slew_time Phenomenon6 Star1) 52.25)
	(= (slew_time Star1 Phenomenon6) 52.25)
	(= (slew_time Phenomenon6 Star2) 40.06)
	(= (slew_time Star2 Phenomenon6) 40.06)
	(= (slew_time Phenomenon6 Phenomenon3) 1.121)
	(= (slew_time Phenomenon3 Phenomenon6) 1.121)
	(= (slew_time Phenomenon6 Star4) 20.1)
	(= (slew_time Star4 Phenomenon6) 20.1)
	(= (slew_time Phenomenon6 Planet5) 81.18)
	(= (slew_time Planet5 Phenomenon6) 81.18)
	(= (slew_time Planet7 GroundStation0) 25)
	(= (slew_time GroundStation0 Planet7) 25)
	(= (slew_time Planet7 Star1) 7.374)
	(= (slew_time Star1 Planet7) 7.374)
	(= (slew_time Planet7 Star2) 15.38)
	(= (slew_time Star2 Planet7) 15.38)
	(= (slew_time Planet7 Phenomenon3) 10.11)
	(= (slew_time Phenomenon3 Planet7) 10.11)
	(= (slew_time Planet7 Star4) 5.246)
	(= (slew_time Star4 Planet7) 5.246)
	(= (slew_time Planet7 Planet5) 33.74)
	(= (slew_time Planet5 Planet7) 33.74)
	(= (slew_time Planet7 Phenomenon6) 20.84)
	(= (slew_time Phenomenon6 Planet7) 20.84)
	(= (slew_time Planet8 GroundStation0) 7.48)
	(= (slew_time GroundStation0 Planet8) 7.48)
	(= (slew_time Planet8 Star1) 43.48)
	(= (slew_time Star1 Planet8) 43.48)
	(= (slew_time Planet8 Star2) 85.15)
	(= (slew_time Star2 Planet8) 85.15)
	(= (slew_time Planet8 Phenomenon3) 41.05)
	(= (slew_time Phenomenon3 Planet8) 41.05)
	(= (slew_time Planet8 Star4) 7.738)
	(= (slew_time Star4 Planet8) 7.738)
	(= (slew_time Planet8 Planet5) 27.62)
	(= (slew_time Planet5 Planet8) 27.62)
	(= (slew_time Planet8 Phenomenon6) 40.18)
	(= (slew_time Phenomenon6 Planet8) 40.18)
	(= (slew_time Planet8 Planet7) 40.07)
	(= (slew_time Planet7 Planet8) 40.07)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite2 Star1)
	(have_image Phenomenon3 thermograph1)
	(have_image Star4 infrared2)
	(have_image Planet5 thermograph1)
	(have_image Phenomenon6 infrared2)
	(have_image Planet7 spectrograph3)
	(have_image Planet8 spectrograph3)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 star1 phenomenon3)
   deleted: (pointing satellite2 phenomenon3)
   added: (pointing satellite2 star1)
   changed: (fuel satellite2) from 153 to 120.58, (fuel-used) from 0 to 32.42
   goals met: 1 of 7
2. (turn_to satellite3 phenomenon3 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 phenomenon3)
   changed: (fuel satellite3) from 163 to 107.84, (fuel-used) from 32.42 to 87.58
   goals met: 1 of 7
3. (turn_to satellite0 phenomenon6 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 120 to 99.9, (fuel-used) from 87.58 to 107.68
   goals met: 1 of 7
4. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 1 of 7
5. (turn_to satellite1 planet8 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 108 to 100.52, (fuel-used) from 107.68 to 115.16
   goals met: 1 of 7
6. (turn_to satellite0 phenomenon3 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon3)
   changed: (fuel satellite0) from 99.9 to 98.779, (fuel-used) from 115.16 to 116.281
   goals met: 1 of 7
7. (turn_to satellite3 planet5 phenomenon3)
   deleted: (pointing satellite3 phenomenon3)
   added: (pointing satellite3 planet5)
   changed: (fuel satellite3) from 107.84 to 95.07, (fuel-used) from 116.281 to 129.051
   goals met: 1 of 7
8. (turn_to satellite0 planet5 phenomenon3)
   deleted: (pointing satellite0 phenomenon3)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 98.779 to 86.009, (fuel-used) from 129.051 to 141.821
   goals met: 1 of 7
9. (turn_to satellite0 phenomenon6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 86.009 to 4.829, (fuel-used) from 141.821 to 223.001
   goals met: 1 of 7
10. (turn_to satellite1 star4 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star4)
   changed: (fuel satellite1) from 100.52 to 92.782, (fuel-used) from 223.001 to 230.739
   goals met: 1 of 7
11. (turn_to satellite1 planet7 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 92.782 to 87.536, (fuel-used) from 230.739 to 235.985
   goals met: 1 of 7
12. (turn_to satellite1 star4 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star4)
   changed: (fuel satellite1) from 87.536 to 82.29, (fuel-used) from 235.985 to 241.231
   goals met: 1 of 7
13. (turn_to satellite1 planet7 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 82.29 to 77.044, (fuel-used) from 241.231 to 246.477
   goals met: 1 of 7
14. (turn_to satellite1 star4 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star4)
   changed: (fuel satellite1) from 77.044 to 71.798, (fuel-used) from 246.477 to 251.723
   goals met: 1 of 7
15. (turn_to satellite1 planet7 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 71.798 to 66.552, (fuel-used) from 251.723 to 256.969
   goals met: 1 of 7
16. (turn_to satellite1 star4 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star4)
   changed: (fuel satellite1) from 66.552 to 61.306, (fuel-used) from 256.969 to 262.215
   goals met: 1 of 7
17. (turn_to satellite1 planet8 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 61.306 to 53.568, (fuel-used) from 262.215 to 269.953
   goals met: 1 of 7
18. (turn_to satellite3 star1 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 star1)
   changed: (fuel satellite3) from 95.07 to 94.1259, (fuel-used) from 269.953 to 270.897
   goals met: 1 of 7
19. (turn_to satellite3 planet5 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 planet5)
   changed: (fuel satellite3) from 94.1259 to 93.1818, (fuel-used) from 270.897 to 271.841
   goals met: 1 of 7
20. (turn_to satellite3 star1 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 star1)
   changed: (fuel satellite3) from 93.1818 to 92.2377, (fuel-used) from 271.841 to 272.785
   goals met: 1 of 7
21. (turn_to satellite3 planet5 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 planet5)
   changed: (fuel satellite3) from 92.2377 to 91.2936, (fuel-used) from 272.785 to 273.729
   goals met: 1 of 7
22. (turn_to satellite1 star4 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star4)
   changed: (fuel satellite1) from 53.568 to 45.83, (fuel-used) from 273.729 to 281.467
   goals met: 1 of 7
23. (turn_to satellite3 star1 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 star1)
   changed: (fuel satellite3) from 91.2936 to 90.3495, (fuel-used) from 281.467 to 282.411
   goals met: 1 of 7
24. (turn_to satellite3 planet5 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 planet5)
   changed: (fuel satellite3) from 90.3495 to 89.4054, (fuel-used) from 282.411 to 283.356
   goals met: 1 of 7
25. (turn_to satellite3 star1 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 star1)
   changed: (fuel satellite3) from 89.4054 to 88.4613, (fuel-used) from 283.356 to 284.3
   goals met: 1 of 7
26. (turn_to satellite3 planet5 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 planet5)
   changed: (fuel satellite3) from 88.4613 to 87.5172, (fuel-used) from 284.3 to 285.244
   goals met: 1 of 7
27. (turn_to satellite3 star1 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 star1)
   changed: (fuel satellite3) from 87.5172 to 86.5731, (fuel-used) from 285.244 to 286.188
   goals met: 1 of 7
28. (turn_to satellite3 planet5 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 planet5)
   changed: (fuel satellite3) from 86.5731 to 85.629, (fuel-used) from 286.188 to 287.132
   goals met: 1 of 7
29. (turn_to satellite3 star1 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 star1)
   changed: (fuel satellite3) from 85.629 to 84.6849, (fuel-used) from 287.132 to 288.076
   goals met: 1 of 7
30. (turn_to satellite3 planet5 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 planet5)
   changed: (fuel satellite3) from 84.6849 to 83.7408, (fuel-used) from 288.076 to 289.02
   goals met: 1 of 7
31. (turn_to satellite3 star1 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 star1)
   changed: (fuel satellite3) from 83.7408 to 82.7967, (fuel-used) from 289.02 to 289.964
   goals met: 1 of 7
32. (turn_to satellite3 planet5 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 planet5)
   changed: (fuel satellite3) from 82.7967 to 81.8526, (fuel-used) from 289.964 to 290.908
   goals met: 1 of 7
33. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 7
34. (turn_to satellite3 star1 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 star1)
   changed: (fuel satellite3) from 81.8526 to 80.9085, (fuel-used) from 290.908 to 291.852
   goals met: 1 of 7
35. (turn_to satellite3 phenomenon3 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 phenomenon3)
   changed: (fuel satellite3) from 80.9085 to 48.4885, (fuel-used) from 291.852 to 324.272
   goals met: 1 of 7
36. (turn_to satellite3 star1 phenomenon3)
   deleted: (pointing satellite3 phenomenon3)
   added: (pointing satellite3 star1)
   changed: (fuel satellite3) from 48.4885 to 16.0685, (fuel-used) from 324.272 to 356.692
   goals met: 1 of 7
37. (calibrate satellite3 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 1 of 7
38. (turn_to satellite3 planet5 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 planet5)
   changed: (fuel satellite3) from 16.0685 to 15.1244, (fuel-used) from 356.692 to 357.637
   goals met: 1 of 7
39. (take_image satellite3 planet5 instrument6 thermograph1)
   added: (have_image planet5 thermograph1)
   changed: (data_capacity satellite3) from 1000 to 816, (data-stored) from 0 to 184
   goals met: 2 of 7
40. (turn_to satellite3 phenomenon3 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 phenomenon3)
   changed: (fuel satellite3) from 15.1244 to 2.3544, (fuel-used) from 357.637 to 370.407
   goals met: 2 of 7
41. (take_image satellite3 phenomenon3 instrument6 thermograph1)
   added: (have_image phenomenon3 thermograph1)
   changed: (data_capacity satellite3) from 816 to 678, (data-stored) from 184 to 322
   goals met: 3 of 7
42. (turn_to satellite1 planet8 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet8)
   changed: (fuel satellite1) from 45.83 to 38.092, (fuel-used) from 370.407 to 378.145
   goals met: 3 of 7
43. (turn_to satellite1 groundstation0 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 38.092 to 30.612, (fuel-used) from 378.145 to 385.625
   goals met: 3 of 7
44. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 3 of 7
45. (turn_to satellite1 phenomenon6 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon6)
   changed: (fuel satellite1) from 30.612 to 3.382, (fuel-used) from 385.625 to 412.855
   goals met: 3 of 7
46. (turn_to satellite2 groundstation0 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 groundstation0)
   changed: (fuel satellite2) from 120.58 to 84.14, (fuel-used) from 412.855 to 449.295
   goals met: 2 of 7
47. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 2 of 7
48. (calibrate satellite2 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 2 of 7
49. (turn_to satellite2 planet8 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 84.14 to 76.66, (fuel-used) from 449.295 to 456.775
   goals met: 2 of 7
50. (take_image satellite2 planet8 instrument4 spectrograph3)
   added: (have_image planet8 spectrograph3)
   changed: (data_capacity satellite2) from 1000 to 760, (data-stored) from 322 to 562
   goals met: 3 of 7
51. (turn_to satellite2 star4 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star4)
   changed: (fuel satellite2) from 76.66 to 68.922, (fuel-used) from 456.775 to 464.513
   goals met: 3 of 7
52. (take_image satellite2 star4 instrument4 infrared2)
   added: (have_image star4 infrared2)
   changed: (data_capacity satellite2) from 760 to 605, (data-stored) from 562 to 717
   goals met: 4 of 7
53. (turn_to satellite2 planet7 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 planet7)
   changed: (fuel satellite2) from 68.922 to 63.676, (fuel-used) from 464.513 to 469.759
   goals met: 4 of 7
54. (take_image satellite2 planet7 instrument4 spectrograph3)
   added: (have_image planet7 spectrograph3)
   changed: (data_capacity satellite2) from 605 to 507, (data-stored) from 717 to 815
   goals met: 5 of 7
55. (turn_to satellite2 star1 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star1)
   changed: (fuel satellite2) from 63.676 to 56.302, (fuel-used) from 469.759 to 477.133
   goals met: 6 of 7
56. (take_image satellite1 phenomenon6 instrument3 infrared2)
   added: (have_image phenomenon6 infrared2)
   changed: (data_capacity satellite1) from 1000 to 960, (data-stored) from 815 to 855
   goals met: 7 of 7
